tap "cirruslabs/cli"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "nrlquaker/createzap"
tap "homebrew/cask-fonts"
tap "zach677/star"

# font-family
cask "font-comic-shanns-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# lazygit
brew "lazygit"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
brew "uv"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# Language server for beancount files
brew "beancount-language-server"
# Generate compilation database for clang tooling
brew "bear"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Open source IA-32 (x86) PC emulator written in C++
brew "bochs"
# Tmux-mem-cpu-load
brew "tmux-mem-cpu-load"
# Compile and execute C "scripts" in one go
brew "c"
# Helper program to build and install c-like libraries
brew "cargo-c"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General purpose Language Server
brew "efm-langserver"
# Web interface for the double-entry bookkeeping software Beancount
brew "fava"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server Protocol for Markdown
brew "marksman"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Node version management
brew "n"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform application and UI framework
brew "qt@5"
# RC file (dotfile) management
brew "rcm"
# Persistent key-value database, with built-in net interface
brew "redis"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Autoformat shell script source code
brew "shfmt"
# Ruby language server
brew "solargraph"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Audio metadata library
brew "taglib"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Icon creator and file and folder customiser
cask "image2icon"
# App for (re)signing iOS apps and bundling them
cask "ios-app-signer"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# App for iOS view debugging
cask "lookin"
# Minimal installer for conda
cask "miniconda"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Messaging app with a focus on speed and security
cask "telegram"
# Keyboard configurator
cask "via"
# Virtualization tool
cask "virtualbuddy"
# System tray app for automatic time tracking
cask "wakatime"
# Free messaging and calling application
cask "wechat"
# The ultimate pasteboard debugger for macOS developers.
cask "whatcopied"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Multiplayer code editor
cask "zed"
# Image compression tool
cask "zipic"
